DataProcessors/ITC_Таймер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>ITC_Таймер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Таймер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>Таймер</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РегистрацияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>РегистрацияВремени</Name>
			<BasedOn>
				<xr:Item>Document.Задача</xr:Item>
				<xr:Item>Catalog.итк_Задача</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Время</xr:Item>
				<xr:Item>AccumulationRegister.Трудозатраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочееВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ITC_Таймер/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбнулитьТаймер(Команда)
	
	ОбнулитьТаймер_Сервер();
	
	ОбновитьТаймер(Команда);
	
КонецПроцедуры

&НаСервере
Процедура ОбнулитьТаймер_Сервер()
	
	Обработки.ITC_Таймер.ОбнулитьТаймерПоПользователю(ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

&НаСервере
Функция СоздатьНарядИзСписка_Сервер()
	яМассивНарядов = Новый Массив();
	
	яПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	яЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Таймер.Задача КАК Задача,
	|	Таймер.Дата КАК Дата,
	|	Таймер.ДатаКонец КАК ДатаКонец,
	|	Таймер.Комментарий КАК Комментарий,
	|	РАЗНОСТЬДАТ(Таймер.Дата, Таймер.ДатаКонец, СЕКУНДА) / 3600 КАК Факт
	|ИЗ
	|	РегистрСведений.Таймер КАК Таймер
	|ГДЕ
	|	Таймер.Пользователь = &Пользователь
	|	И Таймер.ДатаКонец <> &ДатаКонец
	|ИТОГИ ПО
	|	Задача");
	яЗапрос.УстановитьПараметр("Пользователь", яПользователь);
	яЗапрос.УстановитьПараметр("ДатаКонец", Дата(1,1,1));
	яРезультат = яЗапрос.Выполнить();
	
	яОбращения	= яРезультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Задача");
	
	//для каждого обращения откроем форму наряда
	НачатьТранзакцию();
	Пока яОбращения.Следующий() Цикл
		яДок = Документы.РегистрацияВремени.СоздатьДокумент();
		яДок.ДокументОснование = яОбращения.Задача;
		яДок.Ответственный = яПользователь;
		яДок.Дата = ТекущаяДата();
		яВ = яОбращения.Выбрать();
		Пока яВ.Следующий() Цикл
			яС = яДок.РабочееВремя.Добавить();
			ЗаполнитьЗначенияСвойств(яС, яВ);
		КонецЦикла;
		яДок.Записать(РежимЗаписиДокумента.Проведение);
		яМассивНарядов.Добавить(яДок.Ссылка);
		
	КонецЦикла;
	
	ОбнулитьТаймер_Сервер();
	
	ЗафиксироватьТранзакцию();
	
	Возврат яМассивНарядов;
КонецФункции

&НаКлиенте
Процедура СоздатьНарядИзСписка(Команда)
	
	яМассивПараметровОбращений = СоздатьНарядИзСписка_Сервер();
	
	//Для Каждого яНаряд Из яМассивПараметровОбращений Цикл
	//	ОткрытьФорму("Документ.Наряд.Форма.ФормаДокумента", Новый Структура("Ключ", яНаряд), ЭтаФорма);
	//КонецЦикла;
	
	//Для Каждого яПараметры Из яМассивПараметровОбращений Цикл
	//	ОткрытьФорму("Документ.Наряд.Форма.ФормаДокумента", яПараметры, ЭтаФорма, Новый УникальныйИдентификатор());
	//КонецЦикла;
	
	Элементы.ДанныеТаймера.Обновить();
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеТаймера.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ITC_ОбщиеСервер.ЗарегистрироватьАктивность(ПараметрыСеанса.ТекущийПользователь, "ВходВСистему");
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаймер(Команда)
	
	Элементы.ДанныеТаймера.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Таймер_Запустить(Команда)
	
	ITC_ТаймерКлиент.ЗапуститьТаймер(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Таймер_ОстановитьНаСервере(Задача, яДата)
	Обработки.ITC_Таймер.ОстановитьТаймер(Задача, , яДата);
КонецПроцедуры

&НаКлиенте
Процедура Таймер_Остановить(Команда)
	
	Если Элементы.ДанныеТаймера.ТекущаяСтрока <> неопределено Тогда
		Таймер_ОстановитьНаСервере(Элементы.ДанныеТаймера.ТекущиеДанные.Задача, ТекущаяДата());
		ОбновитьТаймер(Команда)
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбновитьТаймер(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОбновитьТаймер(Неопределено);
КонецПроцедуры
